# Pacotes

In [215]:
%pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\gabri\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\gabri\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: There was an error checking the latest version of pip.

In [216]:
import pandas as pd
import glob
import os
 
import openpyxl

# 1) Coleta dos dados

## 1.1) Leitura dos arquivos

#### OBS: Escolhi utilizar os arquivos csv pela facilidade de leitura e poder utilizar chunks de dados

In [217]:
def get_csv_files(years: range = range(2000, 2001), directory: str = "../data", chunksize: int = 10000) -> list: 
    dataframes_list = []

    for year in years:
        file_name = f"GERACAO_USINA_{year}.csv"
        file_path = os.path.join(directory, file_name)

        print(f"\nLendo o arquivo {file_name}...")

        if glob.glob(file_path):
            # Leia o arquivo XLSX
            df = pd.read_csv(file_path, chunksize=chunksize, delimiter=";", encoding="utf-8", low_memory=False)

            # Adicione o DataFrame à lista
            dataframes_list.append(df)
        else:
            raise Exception(f"O arquivo {file_name} não foi encontrado.")
            

    return dataframes_list

In [218]:
try: 
    dataframes = get_csv_files(range(2000, 2021), "../data", 10000)
except Exception as e:
    print(f"Erro: {e}")

Lendo o arquivo GERACAO_USINA_2000.csv...

Lendo o arquivo GERACAO_USINA_2001.csv...

Lendo o arquivo GERACAO_USINA_2002.csv...

Lendo o arquivo GERACAO_USINA_2003.csv...

Lendo o arquivo GERACAO_USINA_2004.csv...

Lendo o arquivo GERACAO_USINA_2005.csv...

Lendo o arquivo GERACAO_USINA_2006.csv...

Lendo o arquivo GERACAO_USINA_2007.csv...

Lendo o arquivo GERACAO_USINA_2008.csv...

Lendo o arquivo GERACAO_USINA_2009.csv...

Lendo o arquivo GERACAO_USINA_2010.csv...

Lendo o arquivo GERACAO_USINA_2011.csv...

Lendo o arquivo GERACAO_USINA_2012.csv...

Lendo o arquivo GERACAO_USINA_2013.csv...

Lendo o arquivo GERACAO_USINA_2014.csv...

Lendo o arquivo GERACAO_USINA_2015.csv...

Lendo o arquivo GERACAO_USINA_2016.csv...

Lendo o arquivo GERACAO_USINA_2017.csv...

Lendo o arquivo GERACAO_USINA_2018.csv...

Lendo o arquivo GERACAO_USINA_2019.csv...

Lendo o arquivo GERACAO_USINA_2020.csv...

### 1.2) Lendo Dataframes por chunks

In [219]:
def reading_chunks(df, cols: list = ["din_instante", "id_subsistema", "val_geracao", "nom_tipousina"]):
    output = pd.DataFrame()

    for chunk in df:
        details = chunk[cols]
    
        display(details.head())

        # output = output.append(details, igore_index=True)

In [220]:
cols = ["din_instante", "id_subsistema", "val_geracao", "nom_tipousina"]

reading_chunks(dataframes[0], cols)

          din_instante id_subsistema  val_geracao  nom_tipousina
0  2000-01-01 00:00:00             N       2422.5  HIDROELÉTRICA
1  2000-01-01 00:00:00            NE       1995.6  HIDROELÉTRICA
2  2000-01-01 00:00:00            NE         13.0  HIDROELÉTRICA
3  2000-01-01 00:00:00            NE        202.5  HIDROELÉTRICA
4  2000-01-01 00:00:00            NE        269.8  HIDROELÉTRICA

              din_instante id_subsistema  val_geracao  nom_tipousina
10000  2000-01-04 18:00:00            NE        740.9  HIDROELÉTRICA
10001  2000-01-04 18:00:00            NE        210.0  HIDROELÉTRICA
10002  2000-01-04 18:00:00             S        707.8  HIDROELÉTRICA
10003  2000-01-04 18:00:00             S        755.4  HIDROELÉTRICA
10004  2000-01-04 18:00:00             S        892.4  HIDROELÉTRICA

              din_instante id_subsistema  val_geracao  nom_tipousina
20000  2000-01-08 12:00:00             S        227.5  HIDROELÉTRICA
20001  2000-01-08 12:00:00             S        219.5  HIDROELÉTRICA
20002  2000-01-08 12:00:00             S        179.3  HIDROELÉTRICA
20003  2000-01-08 12:00:00             S         96.4  HIDROELÉTRICA
20004  2000-01-08 12:00:00             S         34.0  HIDROELÉTRICA

              din_instante id_subsistema  val_geracao  nom_tipousina
30000  2000-01-12 06:00:00             S         20.8        TÉRMICA
30001  2000-01-12 06:00:00             S         50.0  HIDROELÉTRICA
30002  2000-01-12 06:00:00             S        353.4        TÉRMICA
30003  2000-01-12 06:00:00             S        109.2        TÉRMICA
30004  2000-01-12 06:00:00             S        252.0        TÉRMICA

              din_instante id_subsistema  val_geracao  nom_tipousina
40000  2000-01-16 00:00:00            SE       1081.3  HIDROELÉTRICA
40001  2000-01-16 00:00:00            SE        354.2  HIDROELÉTRICA
40002  2000-01-16 00:00:00            SE       4789.0  HIDROELÉTRICA
40003  2000-01-16 00:00:00            SE         50.9  HIDROELÉTRICA
40004  2000-01-16 00:00:00            SE         48.6  HIDROELÉTRICA

              din_instante id_subsistema  val_geracao  nom_tipousina
50000  2000-01-19 18:00:00            SE       1053.7  HIDROELÉTRICA
50001  2000-01-19 18:00:00            SE       1511.8  HIDROELÉTRICA
50002  2000-01-19 18:00:00            SE         90.0  HIDROELÉTRICA
50003  2000-01-19 18:00:00            SE        960.3  HIDROELÉTRICA
50004  2000-01-19 18:00:00            SE         36.0  HIDROELÉTRICA

              din_instante id_subsistema  val_geracao  nom_tipousina
60000  2000-01-23 12:00:00            SE        289.5  HIDROELÉTRICA
60001  2000-01-23 12:00:00            SE        246.7  HIDROELÉTRICA
60002  2000-01-23 12:00:00            SE        130.7        TÉRMICA
60003  2000-01-23 12:00:00            SE         22.7  HIDROELÉTRICA
60004  2000-01-23 12:00:00            SE          0.0        TÉRMICA

              din_instante id_subsistema  val_geracao  nom_tipousina
70000  2000-01-27 06:00:00            SE         51.1  HIDROELÉTRICA
70001  2000-01-27 06:00:00            SE        131.9  HIDROELÉTRICA
70002  2000-01-27 06:00:00            SE         40.0  HIDROELÉTRICA
70003  2000-01-27 06:00:00            SE        102.0  HIDROELÉTRICA
70004  2000-01-27 06:00:00            SE        573.9        NUCLEAR

              din_instante id_subsistema  val_geracao  nom_tipousina
80000  2000-01-31 00:00:00            SE          0.0        TÉRMICA
80001  2000-01-31 00:00:00            SE         60.4  HIDROELÉTRICA
80002  2000-01-31 00:00:00            SE        131.0  HIDROELÉTRICA
80003  2000-01-31 00:00:00            SE         32.7  HIDROELÉTRICA
80004  2000-01-31 00:00:00            SE        225.0  HIDROELÉTRICA

              din_instante id_subsistema  val_geracao  nom_tipousina
90000  2000-02-03 17:00:00            SE         31.2  HIDROELÉTRICA
90001  2000-02-03 17:00:00            SE        157.5  HIDROELÉTRICA
90002  2000-02-03 17:00:00            SE         15.0  HIDROELÉTRICA
90003  2000-02-03 17:00:00            SE        225.0  HIDROELÉTRICA
90004  2000-02-03 17:00:00            SE          0.0        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
100000  2000-02-07 12:00:00            NE        504.5  HIDROELÉTRICA
100001  2000-02-07 12:00:00            NE        230.5  HIDROELÉTRICA
100002  2000-02-07 12:00:00            NE        813.6  HIDROELÉTRICA
100003  2000-02-07 12:00:00            NE        283.9  HIDROELÉTRICA
100004  2000-02-07 12:00:00            NE         17.7  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
110000  2000-02-11 06:00:00             S         67.6  HIDROELÉTRICA
110001  2000-02-11 06:00:00             S        460.1  HIDROELÉTRICA
110002  2000-02-11 06:00:00             S        110.4  HIDROELÉTRICA
110003  2000-02-11 06:00:00             S        150.1  HIDROELÉTRICA
110004  2000-02-11 06:00:00             S        262.6  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
120000  2000-02-15 00:00:00             S         26.0  HIDROELÉTRICA
120001  2000-02-15 00:00:00             S        209.7  HIDROELÉTRICA
120002  2000-02-15 00:00:00             S         50.0        TÉRMICA
120003  2000-02-15 00:00:00             S         49.9        TÉRMICA
120004  2000-02-15 00:00:00             S         91.1        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
130000  2000-02-18 18:00:00             S        198.4        TÉRMICA
130001  2000-02-18 18:00:00            SE         18.0  HIDROELÉTRICA
130002  2000-02-18 18:00:00            SE        127.0  HIDROELÉTRICA
130003  2000-02-18 18:00:00            SE        125.0  HIDROELÉTRICA
130004  2000-02-18 18:00:00            SE        253.1  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
140000  2000-02-22 12:00:00            SE        218.0  HIDROELÉTRICA
140001  2000-02-22 12:00:00            SE         48.3  HIDROELÉTRICA
140002  2000-02-22 12:00:00            SE         46.0  HIDROELÉTRICA
140003  2000-02-22 12:00:00            SE        322.9  HIDROELÉTRICA
140004  2000-02-22 12:00:00            SE        256.3  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
150000  2000-02-26 06:00:00            SE        354.6  HIDROELÉTRICA
150001  2000-02-26 06:00:00            SE        368.3  HIDROELÉTRICA
150002  2000-02-26 06:00:00            SE       1423.0  HIDROELÉTRICA
150003  2000-02-26 06:00:00            SE         75.0  HIDROELÉTRICA
150004  2000-02-26 06:00:00            SE         60.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
160000  2000-03-01 00:00:00             S       1016.5  HIDROELÉTRICA
160001  2000-03-01 00:00:00             S        995.2  HIDROELÉTRICA
160002  2000-03-01 00:00:00             S        357.4  HIDROELÉTRICA
160003  2000-03-01 00:00:00             S          5.0        TÉRMICA
160004  2000-03-01 00:00:00             S         20.3  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao nom_tipousina
170000  2000-03-04 18:00:00             S        238.1       TÉRMICA
170001  2000-03-04 18:00:00             S          0.0       TÉRMICA
170002  2000-03-04 18:00:00             S          0.0       TÉRMICA
170003  2000-03-04 18:00:00             S         24.1       TÉRMICA
170004  2000-03-04 18:00:00             S          0.0       TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
180000  2000-03-08 12:00:00            SE        120.0  HIDROELÉTRICA
180001  2000-03-08 12:00:00            SE        125.0  HIDROELÉTRICA
180002  2000-03-08 12:00:00            SE          8.0  HIDROELÉTRICA
180003  2000-03-08 12:00:00            SE        543.3  HIDROELÉTRICA
180004  2000-03-08 12:00:00            SE         95.9  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
190000  2000-03-12 06:00:00            SE        243.9  HIDROELÉTRICA
190001  2000-03-12 06:00:00            SE         38.4  HIDROELÉTRICA
190002  2000-03-12 06:00:00            SE        219.8  HIDROELÉTRICA
190003  2000-03-12 06:00:00            SE        136.9  HIDROELÉTRICA
190004  2000-03-12 06:00:00            SE         48.5  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
200000  2000-03-16 00:00:00            SE         46.8  HIDROELÉTRICA
200001  2000-03-16 00:00:00            SE         75.0  HIDROELÉTRICA
200002  2000-03-16 00:00:00            SE        162.4  HIDROELÉTRICA
200003  2000-03-16 00:00:00            SE        271.6  HIDROELÉTRICA
200004  2000-03-16 00:00:00            SE         36.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
210000  2000-03-19 18:00:00            SE          0.0        TÉRMICA
210001  2000-03-19 18:00:00            SE       5377.0  HIDROELÉTRICA
210002  2000-03-19 18:00:00            SE         81.0  HIDROELÉTRICA
210003  2000-03-19 18:00:00            SE         95.6  HIDROELÉTRICA
210004  2000-03-19 18:00:00            SE        133.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
220000  2000-03-23 12:00:00            SE        339.5        TÉRMICA
220001  2000-03-23 12:00:00            SE          0.0        TÉRMICA
220002  2000-03-23 12:00:00            SE          0.0        TÉRMICA
220003  2000-03-23 12:00:00            SE          0.0  HIDROELÉTRICA
220004  2000-03-23 12:00:00            SE         75.3  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
230000  2000-03-27 06:00:00            SE         39.4  HIDROELÉTRICA
230001  2000-03-27 06:00:00            SE         14.3  HIDROELÉTRICA
230002  2000-03-27 06:00:00            SE        220.5  HIDROELÉTRICA
230003  2000-03-27 06:00:00            SE         76.8  HIDROELÉTRICA
230004  2000-03-27 06:00:00            SE        120.9  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
240000  2000-03-31 00:00:00            SE         30.0  HIDROELÉTRICA
240001  2000-03-31 00:00:00            SE       1082.0  HIDROELÉTRICA
240002  2000-03-31 00:00:00            SE          3.6  HIDROELÉTRICA
240003  2000-03-31 00:00:00            SE        640.0  HIDROELÉTRICA
240004  2000-03-31 00:00:00            SE         14.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
250000  2000-04-03 18:00:00            SE        225.8  HIDROELÉTRICA
250001  2000-04-03 18:00:00            SE          3.7  HIDROELÉTRICA
250002  2000-04-03 18:00:00            SE        927.7  HIDROELÉTRICA
250003  2000-04-03 18:00:00            SE          0.0        TÉRMICA
250004  2000-04-03 18:00:00            SE         50.0        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
260000  2000-04-07 13:00:00            NE        119.7  HIDROELÉTRICA
260001  2000-04-07 13:00:00            NE         31.0  HIDROELÉTRICA
260002  2000-04-07 13:00:00            NE        290.4  HIDROELÉTRICA
260003  2000-04-07 13:00:00            NE        201.6  HIDROELÉTRICA
260004  2000-04-07 13:00:00            NE          0.0        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
270000  2000-04-11 07:00:00             S        574.5  HIDROELÉTRICA
270001  2000-04-11 07:00:00             S       1098.9  HIDROELÉTRICA
270002  2000-04-11 07:00:00             S        160.6  HIDROELÉTRICA
270003  2000-04-11 07:00:00             S         54.4  HIDROELÉTRICA
270004  2000-04-11 07:00:00             S          5.2        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
280000  2000-04-15 01:00:00             S         15.0  HIDROELÉTRICA
280001  2000-04-15 01:00:00             S          0.0        TÉRMICA
280002  2000-04-15 01:00:00             S          5.0        TÉRMICA
280003  2000-04-15 01:00:00             S        362.9        TÉRMICA
280004  2000-04-15 01:00:00             S          0.0        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
290000  2000-04-18 19:00:00            SE         18.0  HIDROELÉTRICA
290001  2000-04-18 19:00:00            SE        142.0  HIDROELÉTRICA
290002  2000-04-18 19:00:00            SE        130.0  HIDROELÉTRICA
290003  2000-04-18 19:00:00            SE         15.0  HIDROELÉTRICA
290004  2000-04-18 19:00:00            SE        371.8  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
300000  2000-04-22 13:00:00            SE        248.6  HIDROELÉTRICA
300001  2000-04-22 13:00:00            SE         62.5  HIDROELÉTRICA
300002  2000-04-22 13:00:00            SE         10.6  HIDROELÉTRICA
300003  2000-04-22 13:00:00            SE       1484.3  HIDROELÉTRICA
300004  2000-04-22 13:00:00            SE        152.6  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
310000  2000-04-26 07:00:00            SE         13.4  HIDROELÉTRICA
310001  2000-04-26 07:00:00            SE        570.0  HIDROELÉTRICA
310002  2000-04-26 07:00:00            SE       1204.3  HIDROELÉTRICA
310003  2000-04-26 07:00:00            SE         36.0  HIDROELÉTRICA
310004  2000-04-26 07:00:00            SE        246.4  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
320000  2000-04-30 01:00:00            SE        112.0  HIDROELÉTRICA
320001  2000-04-30 01:00:00            SE          0.0        TÉRMICA
320002  2000-04-30 01:00:00            SE       3541.2  HIDROELÉTRICA
320003  2000-04-30 01:00:00            SE         30.2  HIDROELÉTRICA
320004  2000-04-30 01:00:00            SE         40.3  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
330000  2000-05-03 19:00:00            SE          0.0        TÉRMICA
330001  2000-05-03 19:00:00            SE        519.7        TÉRMICA
330002  2000-05-03 19:00:00            SE          0.0        TÉRMICA
330003  2000-05-03 19:00:00            SE         30.0        TÉRMICA
330004  2000-05-03 19:00:00            SE         81.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
340000  2000-05-07 13:00:00            SE         13.0  HIDROELÉTRICA
340001  2000-05-07 13:00:00            SE         40.0  HIDROELÉTRICA
340002  2000-05-07 13:00:00            SE        149.4  HIDROELÉTRICA
340003  2000-05-07 13:00:00            SE          3.6  HIDROELÉTRICA
340004  2000-05-07 13:00:00            SE       1004.7  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
350000  2000-05-11 07:00:00            SE         17.1  HIDROELÉTRICA
350001  2000-05-11 07:00:00            SE        215.8  HIDROELÉTRICA
350002  2000-05-11 07:00:00            SE         34.0  HIDROELÉTRICA
350003  2000-05-11 07:00:00            SE        343.2  HIDROELÉTRICA
350004  2000-05-11 07:00:00            SE        141.2  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
360000  2000-05-15 01:00:00            SE         32.0  HIDROELÉTRICA
360001  2000-05-15 01:00:00            SE         32.0  HIDROELÉTRICA
360002  2000-05-15 01:00:00            SE        138.9  HIDROELÉTRICA
360003  2000-05-15 01:00:00            SE         40.5  HIDROELÉTRICA
360004  2000-05-15 01:00:00            SE         90.6  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
370000  2000-05-18 19:00:00             N       3207.4  HIDROELÉTRICA
370001  2000-05-18 19:00:00            NE       2505.6  HIDROELÉTRICA
370002  2000-05-18 19:00:00            NE         31.0  HIDROELÉTRICA
370003  2000-05-18 19:00:00            NE        379.9  HIDROELÉTRICA
370004  2000-05-18 19:00:00            NE        162.7  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
380000  2000-05-22 12:00:00             S         50.0  HIDROELÉTRICA
380001  2000-05-22 12:00:00             S        350.0        TÉRMICA
380002  2000-05-22 12:00:00             S        245.1        TÉRMICA
380003  2000-05-22 12:00:00             S        145.7        TÉRMICA
380004  2000-05-22 12:00:00            SE         16.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
390000  2000-05-26 05:00:00            SE         27.5  HIDROELÉTRICA
390001  2000-05-26 05:00:00            SE          0.0        TÉRMICA
390002  2000-05-26 05:00:00            SE         72.0  HIDROELÉTRICA
390003  2000-05-26 05:00:00            SE          0.0        TÉRMICA
390004  2000-05-26 05:00:00            SE       4826.1  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
400000  2000-05-29 22:00:00            SE        350.0  HIDROELÉTRICA
400001  2000-05-29 22:00:00            SE       1354.4  HIDROELÉTRICA
400002  2000-05-29 22:00:00            SE         38.9  HIDROELÉTRICA
400003  2000-05-29 22:00:00            SE         79.1  HIDROELÉTRICA
400004  2000-05-29 22:00:00            SE         57.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
410000  2000-06-02 16:00:00             S        886.1  HIDROELÉTRICA
410001  2000-06-02 16:00:00             S        107.7  HIDROELÉTRICA
410002  2000-06-02 16:00:00             S        837.2  HIDROELÉTRICA
410003  2000-06-02 16:00:00             S          4.5        TÉRMICA
410004  2000-06-02 16:00:00             S         29.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
420000  2000-06-06 09:00:00            SE         23.0  HIDROELÉTRICA
420001  2000-06-06 09:00:00            SE        315.0  HIDROELÉTRICA
420002  2000-06-06 09:00:00            SE        285.1  HIDROELÉTRICA
420003  2000-06-06 09:00:00            SE         30.0  HIDROELÉTRICA
420004  2000-06-06 09:00:00            SE        359.6  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
430000  2000-06-10 02:00:00            SE          0.0  HIDROELÉTRICA
430001  2000-06-10 02:00:00            SE        102.7  HIDROELÉTRICA
430002  2000-06-10 02:00:00            SE       1355.7  HIDROELÉTRICA
430003  2000-06-10 02:00:00            SE        280.0  HIDROELÉTRICA
430004  2000-06-10 02:00:00            SE         34.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
440000  2000-06-13 20:00:00             N       3526.7  HIDROELÉTRICA
440001  2000-06-13 20:00:00            NE       2506.4  HIDROELÉTRICA
440002  2000-06-13 20:00:00            NE       1093.4  HIDROELÉTRICA
440003  2000-06-13 20:00:00            NE        232.9  HIDROELÉTRICA
440004  2000-06-13 20:00:00            NE         43.5  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
450000  2000-06-17 13:00:00             S          0.0  HIDROELÉTRICA
450001  2000-06-17 13:00:00             S        329.2        TÉRMICA
450002  2000-06-17 13:00:00             S        110.5        TÉRMICA
450003  2000-06-17 13:00:00             S        244.6        TÉRMICA
450004  2000-06-17 13:00:00            SE          0.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
460000  2000-06-21 06:00:00            SE         28.0  HIDROELÉTRICA
460001  2000-06-21 06:00:00            SE          0.0        TÉRMICA
460002  2000-06-21 06:00:00            SE         71.0  HIDROELÉTRICA
460003  2000-06-21 06:00:00            SE          0.0        TÉRMICA
460004  2000-06-21 06:00:00            SE       3914.5  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
470000  2000-06-24 23:00:00            SE         34.0  HIDROELÉTRICA
470001  2000-06-24 23:00:00            SE        728.9  HIDROELÉTRICA
470002  2000-06-24 23:00:00            SE         39.9  HIDROELÉTRICA
470003  2000-06-24 23:00:00            SE        159.7  HIDROELÉTRICA
470004  2000-06-24 23:00:00            SE       1304.6  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
480000  2000-06-28 17:00:00             S         48.8  HIDROELÉTRICA
480001  2000-06-28 17:00:00             S        621.3  HIDROELÉTRICA
480002  2000-06-28 17:00:00             S        157.2  HIDROELÉTRICA
480003  2000-06-28 17:00:00             S          5.8        TÉRMICA
480004  2000-06-28 17:00:00             S         39.6  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
490000  2000-07-02 10:00:00            SE        257.7  HIDROELÉTRICA
490001  2000-07-02 10:00:00            SE         99.2  HIDROELÉTRICA
490002  2000-07-02 10:00:00            SE        140.7  HIDROELÉTRICA
490003  2000-07-02 10:00:00            SE        219.1  HIDROELÉTRICA
490004  2000-07-02 10:00:00            SE         56.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
500000  2000-07-06 03:00:00            SE         38.0  HIDROELÉTRICA
500001  2000-07-06 03:00:00            SE         30.7  HIDROELÉTRICA
500002  2000-07-06 03:00:00            SE         50.5  HIDROELÉTRICA
500003  2000-07-06 03:00:00            SE        753.6  HIDROELÉTRICA
500004  2000-07-06 03:00:00            SE        201.1  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
510000  2000-07-09 21:00:00             N       3437.5  HIDROELÉTRICA
510001  2000-07-09 21:00:00            NE       1985.8  HIDROELÉTRICA
510002  2000-07-09 21:00:00            NE        154.1  HIDROELÉTRICA
510003  2000-07-09 21:00:00            NE         50.0  HIDROELÉTRICA
510004  2000-07-09 21:00:00            NE        216.2  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
520000  2000-07-13 14:00:00             S         50.0  HIDROELÉTRICA
520001  2000-07-13 14:00:00             S        145.6        TÉRMICA
520002  2000-07-13 14:00:00             S        353.9        TÉRMICA
520003  2000-07-13 14:00:00             S        125.5        TÉRMICA
520004  2000-07-13 14:00:00            SE          8.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
530000  2000-07-17 07:00:00            SE         22.6  HIDROELÉTRICA
530001  2000-07-17 07:00:00            SE          0.0        TÉRMICA
530002  2000-07-17 07:00:00            SE         67.0  HIDROELÉTRICA
530003  2000-07-17 07:00:00            SE          0.0        TÉRMICA
530004  2000-07-17 07:00:00            SE       4778.5  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
540000  2000-07-21 00:00:00            SE         54.7  HIDROELÉTRICA
540001  2000-07-21 00:00:00            SE       1472.7  HIDROELÉTRICA
540002  2000-07-21 00:00:00            SE        495.7  HIDROELÉTRICA
540003  2000-07-21 00:00:00            SE        362.0  HIDROELÉTRICA
540004  2000-07-21 00:00:00            SE         23.4  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
550000  2000-07-24 18:00:00             S        653.9  HIDROELÉTRICA
550001  2000-07-24 18:00:00             S         60.5  HIDROELÉTRICA
550002  2000-07-24 18:00:00             S        533.5  HIDROELÉTRICA
550003  2000-07-24 18:00:00             S          6.1        TÉRMICA
550004  2000-07-24 18:00:00             S         26.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
560000  2000-07-28 11:00:00            SE       1720.0  HIDROELÉTRICA
560001  2000-07-28 11:00:00            SE         31.1  HIDROELÉTRICA
560002  2000-07-28 11:00:00            SE          9.6  HIDROELÉTRICA
560003  2000-07-28 11:00:00            SE        476.8  HIDROELÉTRICA
560004  2000-07-28 11:00:00            SE         21.4  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
570000  2000-08-01 04:00:00            SE         50.0  HIDROELÉTRICA
570001  2000-08-01 04:00:00            SE         55.3  HIDROELÉTRICA
570002  2000-08-01 04:00:00            SE        509.2  HIDROELÉTRICA
570003  2000-08-01 04:00:00            SE       1479.7  HIDROELÉTRICA
570004  2000-08-01 04:00:00            SE        130.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
580000  2000-08-04 22:00:00             N       3317.5  HIDROELÉTRICA
580001  2000-08-04 22:00:00            NE       2490.2  HIDROELÉTRICA
580002  2000-08-04 22:00:00            NE       1073.5  HIDROELÉTRICA
580003  2000-08-04 22:00:00            NE        457.8  HIDROELÉTRICA
580004  2000-08-04 22:00:00            NE        223.3  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
590000  2000-08-08 15:00:00             S        217.5  HIDROELÉTRICA
590001  2000-08-08 15:00:00             S        350.7        TÉRMICA
590002  2000-08-08 15:00:00             S        120.8        TÉRMICA
590003  2000-08-08 15:00:00             S        102.1        TÉRMICA
590004  2000-08-08 15:00:00            SE          8.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
600000  2000-08-12 08:00:00            SE         20.4  HIDROELÉTRICA
600001  2000-08-12 08:00:00            SE          0.0        TÉRMICA
600002  2000-08-12 08:00:00            SE         76.0  HIDROELÉTRICA
600003  2000-08-12 08:00:00            SE          0.0        TÉRMICA
600004  2000-08-12 08:00:00            SE       5104.7  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
610000  2000-08-16 01:00:00            SE         76.4  HIDROELÉTRICA
610001  2000-08-16 01:00:00            SE         32.8  HIDROELÉTRICA
610002  2000-08-16 01:00:00            SE         12.9  HIDROELÉTRICA
610003  2000-08-16 01:00:00            SE         30.0  HIDROELÉTRICA
610004  2000-08-16 01:00:00            SE         37.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
620000  2000-08-19 19:00:00             S        517.7  HIDROELÉTRICA
620001  2000-08-19 19:00:00             S         56.9  HIDROELÉTRICA
620002  2000-08-19 19:00:00             S        590.1  HIDROELÉTRICA
620003  2000-08-19 19:00:00             S          6.4        TÉRMICA
620004  2000-08-19 19:00:00             S         40.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
630000  2000-08-23 11:00:00            SE         49.9  HIDROELÉTRICA
630001  2000-08-23 11:00:00            SE        360.0  HIDROELÉTRICA
630002  2000-08-23 11:00:00            SE         72.5  HIDROELÉTRICA
630003  2000-08-23 11:00:00            SE        993.1  HIDROELÉTRICA
630004  2000-08-23 11:00:00            SE         50.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
640000  2000-08-27 03:00:00            SE       1122.7  HIDROELÉTRICA
640001  2000-08-27 03:00:00            SE        165.4  HIDROELÉTRICA
640002  2000-08-27 03:00:00            SE        400.1  HIDROELÉTRICA
640003  2000-08-27 03:00:00            SE        124.0  HIDROELÉTRICA
640004  2000-08-27 03:00:00            SE         56.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao nom_tipousina
650000  2000-08-30 19:00:00             S          0.0       TÉRMICA
650001  2000-08-30 19:00:00             S         64.0       TÉRMICA
650002  2000-08-30 19:00:00             S         14.0       TÉRMICA
650003  2000-08-30 19:00:00             S         28.2       TÉRMICA
650004  2000-08-30 19:00:00             S         90.1       TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
660000  2000-09-03 10:00:00             S         35.5  HIDROELÉTRICA
660001  2000-09-03 10:00:00             S        222.6  HIDROELÉTRICA
660002  2000-09-03 10:00:00             S        234.2  HIDROELÉTRICA
660003  2000-09-03 10:00:00             S         42.8  HIDROELÉTRICA
660004  2000-09-03 10:00:00             S          5.4        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
670000  2000-09-07 00:00:00            SE         60.0  HIDROELÉTRICA
670001  2000-09-07 00:00:00            SE         41.0  HIDROELÉTRICA
670002  2000-09-07 00:00:00            SE         29.8  HIDROELÉTRICA
670003  2000-09-07 00:00:00            SE        740.0  HIDROELÉTRICA
670004  2000-09-07 00:00:00            SE        450.1  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
680000  2000-09-10 14:00:00            SE         80.1  HIDROELÉTRICA
680001  2000-09-10 14:00:00            SE        188.3  HIDROELÉTRICA
680002  2000-09-10 14:00:00            SE         41.7        TÉRMICA
680003  2000-09-10 14:00:00            SE         31.6  HIDROELÉTRICA
680004  2000-09-10 14:00:00            SE          0.0        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
690000  2000-09-14 04:00:00            SE         29.5  HIDROELÉTRICA
690001  2000-09-14 04:00:00            SE         69.9  HIDROELÉTRICA
690002  2000-09-14 04:00:00            SE         26.0  HIDROELÉTRICA
690003  2000-09-14 04:00:00            SE       1105.9  HIDROELÉTRICA
690004  2000-09-14 04:00:00            SE         35.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
700000  2000-09-17 18:00:00            SE        470.1  HIDROELÉTRICA
700001  2000-09-17 18:00:00            SE        463.2  HIDROELÉTRICA
700002  2000-09-17 18:00:00            SE        102.0        TÉRMICA
700003  2000-09-17 18:00:00            SE          0.0        TÉRMICA
700004  2000-09-17 19:00:00             N         27.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
710000  2000-09-21 09:00:00             S          5.9        TÉRMICA
710001  2000-09-21 09:00:00             S         41.2  HIDROELÉTRICA
710002  2000-09-21 09:00:00             S         20.0  HIDROELÉTRICA
710003  2000-09-21 09:00:00             S         25.0  HIDROELÉTRICA
710004  2000-09-21 09:00:00             S         63.2  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
720000  2000-09-24 23:00:00            SE        499.5  HIDROELÉTRICA
720001  2000-09-24 23:00:00            SE        736.8  HIDROELÉTRICA
720002  2000-09-24 23:00:00            SE       5403.4  HIDROELÉTRICA
720003  2000-09-24 23:00:00            SE        630.7  HIDROELÉTRICA
720004  2000-09-24 23:00:00            SE        117.1  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
730000  2000-09-28 13:00:00            SE          0.0        TÉRMICA
730001  2000-09-28 13:00:00            SE         84.0  HIDROELÉTRICA
730002  2000-09-28 13:00:00            SE         90.0        TÉRMICA
730003  2000-09-28 13:00:00            SE       5039.0  HIDROELÉTRICA
730004  2000-09-28 13:00:00            SE        294.3  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
740000  2000-10-02 03:00:00            SE         30.0  HIDROELÉTRICA
740001  2000-10-02 03:00:00            SE         38.7  HIDROELÉTRICA
740002  2000-10-02 03:00:00            SE        379.0  HIDROELÉTRICA
740003  2000-10-02 03:00:00            SE         39.7  HIDROELÉTRICA
740004  2000-10-02 03:00:00            SE         21.9  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
750000  2000-10-05 18:00:00             N       3100.8  HIDROELÉTRICA
750001  2000-10-05 18:00:00             N         18.7  HIDROELÉTRICA
750002  2000-10-05 18:00:00            NE       2882.7  HIDROELÉTRICA
750003  2000-10-05 18:00:00            NE        227.8  HIDROELÉTRICA
750004  2000-10-05 18:00:00            NE        605.8  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
760000  2000-10-09 09:00:00             S         28.3  HIDROELÉTRICA
760001  2000-10-09 09:00:00             S        167.1  HIDROELÉTRICA
760002  2000-10-09 09:00:00             S         37.5  HIDROELÉTRICA
760003  2000-10-09 09:00:00             S          4.0        TÉRMICA
760004  2000-10-09 09:00:00             S          0.0        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
770000  2000-10-12 23:00:00            SE       1056.3  HIDROELÉTRICA
770001  2000-10-12 23:00:00            SE        428.3  HIDROELÉTRICA
770002  2000-10-12 23:00:00            SE        309.9  HIDROELÉTRICA
770003  2000-10-12 23:00:00            SE        497.2  HIDROELÉTRICA
770004  2000-10-12 23:00:00            SE         25.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
780000  2000-10-16 13:00:00            SE         15.0  HIDROELÉTRICA
780001  2000-10-16 13:00:00            SE        310.0  HIDROELÉTRICA
780002  2000-10-16 13:00:00            SE        101.2  HIDROELÉTRICA
780003  2000-10-16 13:00:00            SE         39.4  HIDROELÉTRICA
780004  2000-10-16 13:00:00            SE         20.7  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
790000  2000-10-20 03:00:00            SE         29.5  HIDROELÉTRICA
790001  2000-10-20 03:00:00            SE         30.1  HIDROELÉTRICA
790002  2000-10-20 03:00:00            SE          9.1  HIDROELÉTRICA
790003  2000-10-20 03:00:00            SE         79.4  HIDROELÉTRICA
790004  2000-10-20 03:00:00            SE         98.3  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
800000  2000-10-23 18:00:00            NE        551.2  HIDROELÉTRICA
800001  2000-10-23 18:00:00            NE        406.8  HIDROELÉTRICA
800002  2000-10-23 18:00:00            NE        196.5  HIDROELÉTRICA
800003  2000-10-23 18:00:00            NE        206.9  HIDROELÉTRICA
800004  2000-10-23 18:00:00            NE       1456.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao nom_tipousina
810000  2000-10-27 08:00:00             S         25.5       TÉRMICA
810001  2000-10-27 08:00:00             S          0.0       TÉRMICA
810002  2000-10-27 08:00:00             S         55.8       TÉRMICA
810003  2000-10-27 08:00:00             S         13.0       TÉRMICA
810004  2000-10-27 08:00:00             S          5.0       TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
820000  2000-10-30 22:00:00            SE         83.8  HIDROELÉTRICA
820001  2000-10-30 22:00:00            SE        378.3  HIDROELÉTRICA
820002  2000-10-30 22:00:00            SE        220.0  HIDROELÉTRICA
820003  2000-10-30 22:00:00            SE        276.5  HIDROELÉTRICA
820004  2000-10-30 22:00:00            SE        338.8  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
830000  2000-11-03 12:00:00            SE        43.00  HIDROELÉTRICA
830001  2000-11-03 12:00:00            SE        49.30  HIDROELÉTRICA
830002  2000-11-03 12:00:00            SE       589.42        NUCLEAR
830003  2000-11-03 12:00:00            SE         0.00        NUCLEAR
830004  2000-11-03 12:00:00            SE       408.50        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
840000  2000-11-07 02:00:00            SE         31.3  HIDROELÉTRICA
840001  2000-11-07 02:00:00            SE         13.0  HIDROELÉTRICA
840002  2000-11-07 02:00:00            SE         29.1  HIDROELÉTRICA
840003  2000-11-07 02:00:00            SE          0.0  HIDROELÉTRICA
840004  2000-11-07 02:00:00            SE        206.1  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
850000  2000-11-10 17:00:00            NE       1265.5  HIDROELÉTRICA
850001  2000-11-10 17:00:00            NE        349.1  HIDROELÉTRICA
850002  2000-11-10 17:00:00            NE          0.0        TÉRMICA
850003  2000-11-10 17:00:00            NE        976.8  HIDROELÉTRICA
850004  2000-11-10 17:00:00            NE        155.5  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
860000  2000-11-14 07:00:00             S          0.0        TÉRMICA
860001  2000-11-14 07:00:00             S         24.1        TÉRMICA
860002  2000-11-14 07:00:00             S        886.0  HIDROELÉTRICA
860003  2000-11-14 07:00:00             S         50.0  HIDROELÉTRICA
860004  2000-11-14 07:00:00             S        125.9        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
870000  2000-11-17 21:00:00            SE        398.0  HIDROELÉTRICA
870001  2000-11-17 21:00:00            SE        384.4  HIDROELÉTRICA
870002  2000-11-17 21:00:00            SE        297.0  HIDROELÉTRICA
870003  2000-11-17 21:00:00            SE        245.4  HIDROELÉTRICA
870004  2000-11-17 21:00:00            SE        696.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
880000  2000-11-21 11:00:00            SE          0.0        TÉRMICA
880001  2000-11-21 11:00:00            SE        317.0        TÉRMICA
880002  2000-11-21 11:00:00            SE         30.0        TÉRMICA
880003  2000-11-21 11:00:00            SE          0.0        TÉRMICA
880004  2000-11-21 11:00:00            SE         39.7  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
890000  2000-11-25 01:00:00            SE         58.7  HIDROELÉTRICA
890001  2000-11-25 01:00:00            SE          0.0  HIDROELÉTRICA
890002  2000-11-25 01:00:00            SE         49.8  HIDROELÉTRICA
890003  2000-11-25 01:00:00            SE         50.0  HIDROELÉTRICA
890004  2000-11-25 01:00:00            SE       1055.1  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
900000  2000-11-28 16:00:00            NE         98.0  HIDROELÉTRICA
900001  2000-11-28 16:00:00             S        252.8  HIDROELÉTRICA
900002  2000-11-28 16:00:00             S       1097.1  HIDROELÉTRICA
900003  2000-11-28 16:00:00             S       1051.8  HIDROELÉTRICA
900004  2000-11-28 16:00:00             S       1259.8  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
910000  2000-12-02 05:00:00            SE        100.1  HIDROELÉTRICA
910001  2000-12-02 05:00:00            SE         50.0  HIDROELÉTRICA
910002  2000-12-02 05:00:00            SE        970.1  HIDROELÉTRICA
910003  2000-12-02 05:00:00            SE         98.9  HIDROELÉTRICA
910004  2000-12-02 05:00:00            SE         12.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
920000  2000-12-05 19:00:00             S        350.1        TÉRMICA
920001  2000-12-05 19:00:00             S        243.4        TÉRMICA
920002  2000-12-05 19:00:00            SE         18.0  HIDROELÉTRICA
920003  2000-12-05 19:00:00            SE         55.0  HIDROELÉTRICA
920004  2000-12-05 19:00:00            SE        130.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
930000  2000-12-09 08:00:00            SE         14.7  HIDROELÉTRICA
930001  2000-12-09 08:00:00            SE         53.0  HIDROELÉTRICA
930002  2000-12-09 08:00:00            SE         50.0  HIDROELÉTRICA
930003  2000-12-09 08:00:00            SE        389.4  HIDROELÉTRICA
930004  2000-12-09 08:00:00            SE          0.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
940000  2000-12-12 22:00:00             S        232.8        TÉRMICA
940001  2000-12-12 22:00:00             S          0.0        TÉRMICA
940002  2000-12-12 22:00:00             S          0.0        TÉRMICA
940003  2000-12-12 22:00:00             S         13.0        TÉRMICA
940004  2000-12-12 22:00:00             S        402.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
950000  2000-12-16 11:00:00            SE         86.2  HIDROELÉTRICA
950001  2000-12-16 11:00:00            SE         53.5  HIDROELÉTRICA
950002  2000-12-16 11:00:00            SE          0.0  HIDROELÉTRICA
950003  2000-12-16 11:00:00            SE         38.3  HIDROELÉTRICA
950004  2000-12-16 11:00:00            SE         34.0  HIDROELÉTRICA

               din_instante id_subsistema  val_geracao  nom_tipousina
960000  2000-12-20 01:00:00             S         41.5  HIDROELÉTRICA
960001  2000-12-20 01:00:00             S         66.3  HIDROELÉTRICA
960002  2000-12-20 01:00:00             S         67.5  HIDROELÉTRICA
960003  2000-12-20 01:00:00             S         40.0  HIDROELÉTRICA
960004  2000-12-20 01:00:00             S          0.0        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
970000  2000-12-23 14:00:00            SE      84.0000  HIDROELÉTRICA
970001  2000-12-23 14:00:00            SE     413.4700        NUCLEAR
970002  2000-12-23 14:00:00            SE    1350.3236        NUCLEAR
970003  2000-12-23 14:00:00            SE       0.0000        TÉRMICA
970004  2000-12-23 14:00:00            SE       0.0000        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
980000  2000-12-27 04:00:00             S        482.9  HIDROELÉTRICA
980001  2000-12-27 04:00:00             S         73.0  HIDROELÉTRICA
980002  2000-12-27 04:00:00             S         63.6  HIDROELÉTRICA
980003  2000-12-27 04:00:00             S        271.8  HIDROELÉTRICA
980004  2000-12-27 04:00:00             S         10.3        TÉRMICA

               din_instante id_subsistema  val_geracao  nom_tipousina
990000  2000-12-30 17:00:00            SE        135.0        TÉRMICA
990001  2000-12-30 17:00:00            SE       5406.9  HIDROELÉTRICA
990002  2000-12-30 17:00:00            SE         47.7  HIDROELÉTRICA
990003  2000-12-30 17:00:00            SE         39.0  HIDROELÉTRICA
990004  2000-12-30 17:00:00            SE        150.0  HIDROELÉTRICA

# 2) Preparação inicial dos dados

## 2.1) Seleção dos dados